
# Список предметов
things = {'карандаш': 20, 'зеркальце': 100, 'зонт': 500, 'рубашка': 300, 
          'брюки': 1000, 'бумага': 200, 'молоток': 600, 'пила': 400, 'удочка': 1200,
          'расческа': 40, 'котелок': 820, 'палатка': 5240, 'брезент': 2130, 'спички': 10}

N = int(input()) * 1000 # Вместимость рюкзака в граммах

sorted_things = {v:k for k, v in things.items()}

for i in sorted(sorted_things, reverse=True):
    if N >= i:
        print(sorted_things[i], end=' ')
        N -= i
        